---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor
source: html/28b0dae2-8ce7-4164-2c23-2cc182daca51.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor Method

Constructs a default instance of deformed shape settings.

## Syntax (C#)
```csharp
public AnalysisDisplayDeformedShapeSettings()
```